{"standard": "CCSS.ELA-LITERACY.W.4.9", "topic": "desert", "fmt_instr_rubric": "The output should be a markdown code snippet formatted in the following schema, including the leading and trailing \"```json\" and \"```\":\n\n```json\n{\n\t\"rubric\": string  // Rubric for this assesment task as expected by the Common Core State Standard definition provided by user\n}\n```", "fmt_instr_frq": "The output should be a markdown code snippet formatted in the following schema, including the leading and trailing \"```json\" and \"```\":\n\n```json\n{\n\t\"step-1\": string  // step 1 reasoning\n\t\"step-2\": string  // step 2 reasoning\n\t\"step-3\": string  // step 3 reasoning\n\t\"context\": string  // generated context paragraph\n\t\"frq\": string  // generated free respoce question\n}\n```", "fmt_instr_frq_qa": "The output should be a markdown code snippet formatted in the following schema, including the leading and trailing \"```json\" and \"```\":\n\n```json\n{\n\t\"frq_qa_passed\": string  // Boolean value to idicate if the CONTEXT and FRQ is meeting the Common Core State Standard and topic provided by user. True = meets, False = Does not meet\n\t\"frq_qa_reason\": string  // Justification why the CONTEXT and/or the FRQ isnt meeting Common Core State Standard. If both the CONTEXT and the FRQ are meeting CCSS provide value N/A\n\t\"adjusted_context\": string  // Adjusted CONTEXT meeting the user provided Common Core State Standard using and the topic. If original CONTEXT is meeting CCSS provide value N/A\n\t\"adjusted_frq\": string  // Adjusted FRQ meeting the user provided Common Core State Standard and the topic. NEW FRQ must be related to the NEW CONTEXT. If original FRQ is meeting CCSS provide value N/A\n}\n```", "fmt_instr_rubric_qa": "The output should be a markdown code snippet formatted in the following schema, including the leading and trailing \"```json\" and \"```\":\n\n```json\n{\n\t\"rubric_qa_passed\": string  // Boolean value to idicate if the RUBRIC is meeting the Common Core State Standard provided by user. True = meets, False = Does not meet\n\t\"rubric_qa_reason\": string  // Justification why RUBRICS isnt meeting Common Core State Standard. If the Rubric is meeting CCSS provide value N/A\n\t\"rubric_qa_new\": string  // New regenerated Rubrics meeting Common Core State Standard. If the original Rubric is meeting CCSS provide value N/A\n}\n```", "EXAMPLE_FRQ_01": "User input: Common Core State Standard is CCSS.ELA-LITERACY.W.6.3 and topic is \"morning routine\".\nAssistant answer: ```json{\n\t\"step-1\": \"The standard CCSS.ELA-LITERACY.W.6.3 requires students to write narratives to develop real or imagined experiences or events using effective technique, relevant descriptive details, and well-structured event sequences.\",\n\t\"step-2\": \"The assessment must test the student's ability to write a narrative that includes effective techniques, relevant descriptive details, and a well-structured event sequence.\",\n\t\"step-3\": \"The CONTEXT paragraph should be sufficiently detailed but not excessively long, providing enough complexity for a 6th-grade student to generate a narrative based on it.\",\n\t\"context\": \"Maria had a morning routine that she followed every single day. She would start her day by waking up to the sound of her melodious alarm at 6:30 a.m. After quickly turning it off, she'd head to the kitchen where her mom would already have a steaming cup of hot chocolate waiting for her. Next, she would grab her toothbrush and toothpaste and head to the bathroom to brush her teeth. The bathroom mirror would be slightly fogged up from her older brother's hot shower, making her trace smiley faces on it before wiping it clean. Once she was ready, she'd head to her room to put on her favorite outfit: a blue shirt with white stars, and jeans that had a small rip on the knee which, according to her, gave it character. After getting dressed, she would sit at her desk and skim through her planner to prepare for the day ahead, occasionally jotting down notes in the margins.\",\n\t\"frq\": \"Write a narrative about Maria's morning routine from her perspective. Your narrative should have a beginning, middle, and end. Make sure to use effective narrative techniques, relevant descriptive details, and structure the events in a sequential manner.\"\n}```", "EXAMPLE_FRQ_02": "User input: Common Core State Standard is CCSS.ELA-LITERACY.W.4.9 and topic is ocean.\nAssistant answer: ```json{\n\t\"step-1\": \"The Common Core State Standard CCSS.ELA-LITERACY.W.4.9 states that 4th-grade students should 'Draw evidence from literary or informational texts to support analysis, reflection, and research.'\",\n\t\"step-2\": \"The assessment will test the student's ability to extract information from a context paragraph related to the ocean. The student should then use this information to support their analysis or reflection in response to a specific free-response question.\",\n\t\"step-3\": \"For a 4th-grade level, the context paragraph should be between 100-150 words. It should contain a mix of factual and interpretive details, providing a well-rounded basis for answering the free-response question.\",\n\t\"context\": \"The ocean covers more than 70% of Earth's surface and serves as home to a myriad of creatures, from microscopic plankton to massive whales. It also plays a crucial role in regulating the planet's climate by absorbing carbon dioxide. Coral reefs, often referred to as the 'rainforests of the sea,' host a variety of marine life and contribute to biodiversity. However, human activities like pollution, overfishing, and climate change are putting ocean ecosystems at risk. Notable efforts are being made to conserve this vital resource, including the creation of marine protected areas and public awareness campaigns.\",\n\t\"frq\": \"Based on the context provided, what are some ways the ocean is important to Earth and its inhabitants? Also, what challenges are oceans facing according to the text? Provide evidence from the text to support your answer.\"\n}```", "EXAMPLE_RUBRIC_01": "User input: Common Core State Standard is CCSS.ELA-LITERACY.W.4.9. Take into consideration the definition of this standard provided below in step-1.\nCONTEXT and FREE RESPONSE QUESTION are also included in following JSON: \n{\n\t\"step-1\": \"The Common Core State Standard CCSS.ELA-LITERACY.W.4.9 states that 4th-grade students should 'Draw evidence from literary or informational texts to support analysis, reflection, and research.'\",\n\t\"step-2\": \"The assessment will test the student's ability to extract information from a context paragraph related to the ocean. The student should then use this information to support their analysis or reflection in response to a specific free-response question.\",\n\t\"step-3\": \"For a 4th-grade level, the context paragraph should be between 100-150 words. It should contain a mix of factual and interpretive details, providing a well-rounded basis for answering the free-response question.\",\n\t\"context\": \"The ocean covers more than 70% of Earth's surface and serves as home to a myriad of creatures, from microscopic plankton to massive whales. It also plays a crucial role in regulating the planet's climate by absorbing carbon dioxide. Coral reefs, often referred to as the 'rainforests of the sea,' host a variety of marine life and contribute to biodiversity. However, human activities like pollution, overfishing, and climate change are putting ocean ecosystems at risk. Notable efforts are being made to conserve this vital resource, including the creation of marine protected areas and public awareness campaigns.\",\n\t\"frq\": \"Based on the context provided, what are some ways the ocean is important to Earth and its inhabitants? Also, what challenges are oceans facing according to the text? Provide evidence from the text to support your answer.\"\n}\nAssistant answer: ```json{\n\t\"rubric\": \"### Assessment Rubric for Free Response Question\n\n#### Criteria for Evaluation\n\n1. **Drawing Evidence (5 points)**: Student must draw clear evidence from the context paragraph to support their answer.\n    - 5 points: Provides direct quotes or paraphrases that are highly relevant to the question.\n    - 3 points: Provides some evidence but it's either partially relevant or not directly quoted.\n    - 1 point: Makes a generalized or vague reference to the text.\n    - 0 points: Does not reference the text.\n\n2. **Analysis and Reflection (5 points)**: Student should analyze the importance of the ocean to Earth and its challenges, and may include personal reflection.\n    - 5 points: Thoroughly analyzes both the importance and challenges, possibly including personal reflection.\n    - 3 points: Partially analyzes either the importance or challenges, with some evidence.\n    - 1 point: Minimal analysis with limited or no evidence.\n    - 0 points: No analysis or reflection.\n\n3. **Clarity and Organization (3 points)**: Answer should be clear, concise, and well-organized.\n    - 3 points: Answer is clear, concise, and logically organized.\n    - 2 points: Answer is mostly clear but may lack some organization.\n    - 1 point: Answer is disorganized or unclear.\n    - 0 points: Answer is incomprehensible.\n\n4. **Grammar and Mechanics (2 points)**: The answer should be free of grammatical and spelling errors.\n    - 2 points: No errors.\n    - 1 point: Few minor errors.\n    - 0 points: Numerous errors that hinder comprehension.\n\n### Scoring Guide\n- 13-15 points: Excellent\n- 10-12 points: Good\n- 6-9 points: Needs Improvement\n- 0-5 points: Unsatisfactory\"\n}```", "EXAMPLE_RUBRIC_02": "Common Core State Standard is CCSS.ELA-LITERACY.W.6.3. Take into consideration the definition of this standard provided below in step-1.\nCONTEXT and FREE RESPONSE QUESTION are also included in following JSON: \n{\n\t\"step-1\": \"The standard CCSS.ELA-LITERACY.W.6.3 requires students to write narratives to develop real or imagined experiences or events using effective technique, relevant descriptive details, and well-structured event sequences.\",\n\t\"step-2\": \"The assessment must test the student's ability to write a narrative that includes effective techniques, relevant descriptive details, and a well-structured event sequence.\",\n\t\"step-3\": \"The CONTEXT paragraph should be sufficiently detailed but not excessively long, providing enough complexity for a 6th-grade student to generate a narrative based on it.\",\n\t\"context\": \"Maria had a morning routine that she followed every single day. She would start her day by waking up to the sound of her melodious alarm at 6:30 a.m. After quickly turning it off, she'd head to the kitchen where her mom would already have a steaming cup of hot chocolate waiting for her. Next, she would grab her toothbrush and toothpaste and head to the bathroom to brush her teeth. The bathroom mirror would be slightly fogged up from her older brother's hot shower, making her trace smiley faces on it before wiping it clean. Once she was ready, she'd head to her room to put on her favorite outfit: a blue shirt with white stars, and jeans that had a small rip on the knee which, according to her, gave it character. After getting dressed, she would sit at her desk and skim through her planner to prepare for the day ahead, occasionally jotting down notes in the margins.\",\n\t\"frq\": \"Write a narrative from Maria's perspective about a particular morning where something unexpected happens during her routine. Use effective narrative techniques, integrate relevant descriptive details, and structure the events in a sequential manner. Make sure your narrative has a beginning, middle, and end. Include dialogue, internal thoughts, or actions that help to develop the characters and events.\"\n}\nAssistant answer: ```json{\n\t\"rubric\": \"1. Effective Techniques (0-10 points): 0-2 points for lacking effective techniques, 3-5 for some use, 6-8 for good use, and 9-10 for excellent use.\n2. Relevant Descriptive Details (0-10 points): 0-2 points for lacking details, 3-5 for some details, 6-8 for good details, and 9-10 for excellent details.\n3. Well-Structured Event Sequences (0-10 points): 0-2 for poor structure, 3-5 for some structure, 6-8 for good structure, and 9-10 for excellent structure.\n4. Dialogue, Internal Thoughts, Actions to Develop Characters and Events (0-5 points): 0-1 for lacking elements, 2-3 for some use, and 4-5 for effective use.\n5. Beginning, Middle, and End (0-5 points): 0-1 for missing or unclear, 2-3 for present but lacking, and 4-5 for clear and effective.\"\n}```", "rubric": "```json\n{\n\t\"rubric\": \"### Assessment Rubric for Free Response Question\n\n#### Criteria for Evaluation\n\n1. **Drawing Evidence (5 points)**: Student must draw clear evidence from the context paragraph to support their answer.\n    - 5 points: Provides direct quotes or paraphrases that are highly relevant to the question.\n    - 3 points: Provides some evidence but it's either partially relevant or not directly quoted.\n    - 1 point: Makes a generalized or vague reference to the text.\n    - 0 points: Does not reference the text.\n\n2. **Analysis and Reflection (5 points)**: Student should analyze the unique features of deserts that make them different from other types of environments, and may include personal reflection.\n    - 5 points: Thoroughly analyzes the unique features of deserts, possibly including personal reflection.\n    - 3 points: Partially analyzes the unique features of deserts, with some evidence.\n    - 1 point: Minimal analysis with limited or no evidence.\n    - 0 points: No analysis or reflection.\n\n3. **Clarity and Organization (3 points)**: Answer should be clear, concise, and well-organized.\n    - 3 points: Answer is clear, concise, and logically organized.\n    - 2 points: Answer is mostly clear but may lack some organization.\n    - 1 point: Answer is disorganized or unclear.\n    - 0 points: Answer is incomprehensible.\n\n4. **Grammar and Mechanics (2 points)**: The answer should be free of grammatical and spelling errors.\n    - 2 points: No errors.\n    - 1 point: Few minor errors.\n    - 0 points: Numerous errors that hinder comprehension.\n\n### Scoring Guide\n- 13-15 points: Excellent\n- 10-12 points: Good\n- 6-9 points: Needs Improvement\n- 0-5 points: Unsatisfactory\"\n}\n```", "reasoning_context_frq": "```json\n{\n\t\"step-1\": \"The Common Core State Standard CCSS.ELA-LITERACY.W.4.9 states that 4th-grade students should 'Draw evidence from literary or informational texts to support analysis, reflection, and research.'\",\n\t\"step-2\": \"The assessment will test the student's ability to extract information from a context paragraph related to deserts. The student should then use this information to support their analysis or reflection in response to a specific free-response question.\",\n\t\"step-3\": \"For a 4th-grade level, the context paragraph should be between 100-150 words. It should contain a mix of factual and interpretive details, providing a well-rounded basis for answering the free-response question.\",\n\t\"context\": \"Deserts are characterized by their dry climate and lack of vegetation. They can be found all around the world, from the Sahara in Africa to the Mojave in North America. Despite the harsh conditions, deserts are home to a variety of plants and animals that have adapted to the environment, such as cacti and scorpions. The sparse vegetation found in deserts makes them vulnerable to erosion, which can lead to the formation of unique landforms like mesas and sand dunes. Additionally, deserts can be important sources of natural resources like minerals and fossil fuels, as well as popular tourist destinations for activities like hiking and camping.\",\n\t\"frq\": \"Based on the context provided, what are some unique features of deserts that make them different from other types of environments? Provide evidence from the text to support your answer.\"\n}```", "frq_qa": "```json\n{\n\t\"frq_qa_passed\": true,\n\t\"frq_qa_reason\": \"N/A\",\n\t\"adjusted_context\": \"Deserts are characterized by their dry climate and lack of vegetation. They can be found all around the world, from the Sahara in Africa to the Mojave in North America. Despite the harsh conditions, deserts are home to a variety of plants and animals that have adapted to the environment, such as cacti and scorpions. The sparse vegetation found in deserts makes them vulnerable to erosion, which can lead to the formation of unique landforms like mesas and sand dunes. Additionally, deserts can be important sources of natural resources like minerals and fossil fuels, as well as popular tourist destinations for activities like hiking and camping. This paragraph provides a mix of factual and interpretive details, which can be used to support analysis or reflection in response to a specific free-response question. The length of the paragraph is also appropriate for a 4th-grade level.\",\n\t\"adjusted_frq\": \"What are some unique features of deserts that make them different from other types of environments? Use the information from the context paragraph to support your answer. How do these unique features impact the plants, animals, and people that live in the desert? Provide examples from the text to support your answer.\"\n}\n``` \nThe provided CONTEXT and FRQ meet the requirements of the CCSS. The context paragraph provides a mix of factual and interpretive details, which can be used to support analysis or reflection in response to a specific free-response question. The length of the paragraph is also appropriate for a 4th-grade level. The FRQ is relevant to the context and requires the student to draw evidence from the text to support their answer. The question also requires the student to reflect on the impact of the unique features of deserts on the plants, animals, and people that live in the desert, which aligns with the CCSS.", "rubics_qa": "```json\n{\n\t\"rubric_qa_passed\": true,\n\t\"rubric_qa_reason\": \"N/A\",\n\t\"rubric_qa_new\": \"N/A\"\n}\n```\nThe provided rubric aligns with the CCSS.ELA-LITERACY.W.4.9 standard. It assesses the student's ability to draw evidence from the context paragraph to support their answer, analyze and reflect on the unique features of deserts, and write a clear, concise, and well-organized response that is free of grammatical and spelling errors. The rubric also provides a scoring guide that aligns with the CCSS requirements. Therefore, the output is True."}