 "rubric": "```json\n{\n    \"rubric\": \"### Assessment Rubric for Free Response Question\n\n#### Criteria for Evaluation\n\n1. **Drawing Evidence (5 points)**: Student must draw clear evidence from the context paragraph to support their answer.\n    - 5 points: Provides direct quotes or paraphrases that are highly relevant to the question.\n    - 3 points: Provides some evidence but it's either partially relevant or not directly quoted.\n    - 1 point: Makes a generalized or vague reference to the text.\n    - 0 points: Does not reference the text.\n\n2. **Analysis and Reflection (5 points)**: Student should analyze Sigmund Freud's contributions to psychology and Western culture.\n    - 5 points: Thoroughly analyzes Freud's contributions to both psychology and Western culture, with evidence from the text.\n    - 3 points: Partially analyzes either Freud's contributions to psychology or Western culture, with some evidence.\n    - 1 point: Minimal analysis with limited or no evidence.\n    - 0 points: No analysis or reflection.\n\n3. **Clarity and Organization (3 points)**: Answer should be clear, concise, and well-organized.\n    - 3 points: Answer is clear, concise, and logically organized.\n    - 2 points: Answer is mostly clear but may lack some organization.\n    - 1 point: Answer is disorganized or unclear.\n    - 0 points: Answer is incomprehensible.\n\n4. **Grammar and Mechanics (2 points)**: The answer should be free of grammatical and spelling errors.\n    - 2 points: No errors.\n    - 1 point: Few minor errors.\n    - 0 points: Numerous errors that hinder comprehension.\n\n### Scoring Guide\n- 13-15 points: Excellent\n- 10-12 points: Good\n- 6-9 points: Needs Improvement\n- 0-5 points: Unsatisfactory\"\n}\n```",
  "reasoning_context_frq": "```json{\n    \"step-1\": \"The Common Core State Standard CCSS.ELA-LITERACY.W.4.9 states that 4th-grade students should 'Draw evidence from literary or informational texts to support analysis, reflection, and research.'\",\n    \"step-2\": \"The assessment will test the student's ability to extract information from a context paragraph related to Sigmund Freud. The student should then use this information to support their analysis or reflection in response to a specific free-response question.\",\n    \"step-3\": \"For a 4th-grade level, the context paragraph should be between 100-150 words. It should contain a mix of factual and interpretive details, providing a well-rounded basis for answering the free-response question.\",\n    \"context\": \"Sigmund Freud was an Austrian neurologist and founder of psychoanalysis, a clinical method for treating psychopathology through dialogue between a patient and a psychoanalyst. His theories and techniques had a significant impact on psychology and Western culture as a whole. Freud believed that the human psyche was divided into three parts: the id, ego, and superego. The id represents primitive and instinctual drives, while the ego acts as a mediator between the id and external reality. The superego is responsible for regulating social norms and morals. Freud's theories on the unconscious mind, dream interpretation, and the human psyche's structure have been highly influential in both the fields of psychology and literature.\",\n    \"frq\": \"Based on the context provided, explain who Sigmund Freud was and what his contributions to psychology and Western culture were. Provide evidence from the text to support your answer.\"\n}```",
  "frq_qa": "```json\n{\n    \"frq_qa_passed\": true,\n    \"frq_qa_reason\": \"N/A\",\n    \"adjusted_context\": \"N/A\",\n    \"adjusted_frq\": \"N/A\"\n}\n```\nThe provided CONTEXT and FRQ meet the requirements of the Common Core State Standard CCSS.ELA-LITERACY.W.4.9. The context paragraph provides a mix of factual and interpretive details about Sigmund Freud, and the free-response question asks the student to draw evidence from the text to support their answer. The length of the context paragraph is also appropriate for a 4th-grade level. Therefore, no adjustments are needed.",
  "rubric_qa": "```json\n{\n    \"rubric_qa_passed\": false,\n    \"rubric_qa_reason\": \"The rubric does not align with the CCSS. The CCSS standard requires students to 'draw evidence from literary or informational texts to support analysis, reflection, and research'. The rubric only assesses the ability to draw evidence from a single context paragraph, which is not sufficient to meet the CCSS standard. Additionally, the rubric does not assess the ability to conduct research or reflect on the significance of the evidence.\",\n    \"rubric_qa_new\": \"### Assessment Rubric for Free Response Question\n\n#### Criteria for Evaluation\n\n1. **Drawing Evidence (5 points)**: Student must draw clear evidence from literary or informational texts to support their answer.\n    - 5 points: Provides direct quotes or paraphrases that are highly relevant to the question and come from multiple sources.\n    - 3 points: Provides some evidence but it's either partially relevant or not directly quoted, or comes from a single source.\n    - 1 point: Makes a generalized or vague reference to the text.\n    - 0 points: Does not reference the text.\n\n2. **Analysis and Reflection (5 points)**: Student should analyze Sigmund Freud's contributions to psychology and Western culture, and reflect on their significance.\n    - 5 points: Thoroughly analyzes Freud's contributions to both psychology and Western culture, with evidence from multiple sources, and reflects on their significance.\n    - 3 points: Partially analyzes either Freud's contributions to psychology or Western culture, with some evidence, and/or does not reflect on their significance.\n    - 1 point: Minimal analysis with limited or no evidence, and/or no reflection on significance.\n    - 0 points: No analysis or reflection.\n\n3. **Clarity and Organization (3 points)**: Answer should be clear, concise, and well-organized.\n    - 3 points: Answer is clear, concise, and logically organized.\n    - 2 points: Answer is mostly clear but may lack some organization.\n    - 1 point: Answer is disorganized or unclear.\n    - 0 points: Answer is incomprehensible.\n\n4. **Grammar and Mechanics (2 points)**: The answer should be free of grammatical and spelling errors.\n    - 2 points: No errors.\n    - 1 point: Few minor errors.\n    - 0 points: Numerous errors that hinder comprehension.\n\n### Scoring Guide\n- 13-15 points: Excellent\n- 10-12 points: Good\n- 6-9 points: Needs Improvement\n- 0-5 points: Unsatisfactory\"\n}\n```"